<template>
  <div class="container">
    <div class="py-4" />
    <h1>閑話</h1>
    <br>
    <p>趣味など、どうでも良い話をつらつらと書き連ねていこうと思います。</p>
    <br>
    <h3>
      趣味
    </h3>
    <br>
    <ul>
      <li>読書</li>
      <li>アニメ</li>
      <li>音楽鑑賞</li>
      <li>写真撮影</li>
      <li>文化祭</li>
    </ul>
    <br>
    <div class="border" />
    <br>
    <h3>読書</h3>
    <p>
      僕、実は結構本を読む人なんですよ。
      幼稚園児の頃から児童文学を読み耽っていて、エルマーのぼうけんとかめちゃ読んでましたね。あのシリーズだったら16ひきのりゅうが一番好き。
      小2くらいからは星新一にどハマりして、小4くらいまでずーっと星新一読んでました。新潮文庫出版のやつは全巻読んでるはず。
      でもどこで道を踏み外したのか、小5くらいからラノベばっか読むようになり、休み時間机の上に俺ガイルを積んでるような小学生になってしまいました。
      とはいえ一般文芸（いわゆるエンタメ小説や純文学など）もある程度は読んでいたようで、小5の時に書いたおすすめの本が「神様のカルテ」になっていました。あれも良い話ですよね。大好き。
      小6の頃は有川浩にどハマりしていた記憶が。図書館戦争でハマり、植物図鑑や阪急電車、レインツリーの国などいろいろ読んでました。

      そんなこんなで中学生になった頃には典型的なオタクになっており、学校の机の上にラノベを10冊以上積み上げてラノベタワー作ったりとかしてました。男子校最高。
      中1になってからは海外文学にも手を出すようになり、カミュの異邦人やカフカの変身などを読んでいました。
      ラノベ以外の小説であれば母親がいくらでも買ってくれたので、それが功を奏したのかもしれません。
      あと、中3の時に読んだ金閣寺がずっと印象に残ってますね。一番好きな本かもしれない。

      高1のころに塾で担当になった先生が読書家で、その先生から勧められた作家が全部どハマりしたんですよ。
      桜庭一樹さん、彩瀬まるさん、島本理生さんとか。
      特に桜庭一樹さんにハマりましたねー。ゴシックシリーズ以外は大体読みました。まとまった時間ある時にゴシックシリーズも読みたい。
      桜庭一樹さんの作品は、砂糖菓子の弾丸は撃ち抜けない、私の男、赤朽葉家の伝説あたりが特に好き。
      彩瀬まるさんはやっぱり骨を彩るが一番良いですね。一番最初に読んだ本ってこともありますけど。読んだ瞬間にあの繊細な描写へ引き込まれました。
      島本理生さんはアンダスタンドメイビーですかね。思春期特有の不安定な気持ちを表現した描写がどうにも良い。
      金閣寺然りアンダスタンドメイビー然り、やっぱり主人公が自分に似ている小説に惹かれるのかもしれない。
    </p>
    <h4>おすすめの本（作者名順）</h4>
    <br>
    <ul>
      <li>骨を彩る（彩瀬まる）</li>
      <li>わたしが・棄てた・女（遠藤周作）</li>
      <li>博士の愛した数式（小川洋子）</li>
      <li>変身（カフカ）</li>
      <li>砂糖菓子の弾丸は撃ち抜けない（桜庭一樹）</li>
      <li>私の男（桜庭一樹）</li>
      <li>赤朽葉家の伝説（桜庭一樹）</li>
      <li>ファミリーポートレイト（桜庭一樹）</li>
      <li>アンダスタンドメイビー（島本理生）</li>
      <li>神様のカルテシリーズ（夏川草介）</li>
      <li>イノセントデイズ（早見和真）</li>
      <li>ボッコちゃん（星新一）</li>
      <li>金閣寺（三島由紀夫）</li>
      <li>青の時代（三島由紀夫）</li>
    </ul>
    <div class="border" />
    <br>
    <h3>アニメ</h3>
    <p>
      前述の通り小5から見事オタクになった僕は、中学3年間ひたすらアニメを観続ける毎日を送っていました。
      最近はあまり観なくなりましたが、エヴァだけは大好きで4DXも全部観に行きましたw
      とりあえずおすすめの作品だけ。
    </p>
    <h4>おすすめのアニメ</h4>
    <br>
    <ul>
      <li>新世紀エヴァンゲリオン（アニメ版、Air/まごころを君に、新劇場版3作）</li>
      <li>魔法少女まどかマギカ（アニメ版、劇場版3作）</li>
      <li>Fateシリーズ（特にstay night, UBW, Apocrypha, Zero）</li>
      <li>ギルティクラウン</li>
      <li>オーバーロード</li>
      <li>恋と選挙とチョコレート</li>
    </ul>
    <div class="border" />
    <br>
    <h3>音楽</h3>
    <p>
      とにかく東京事変が好き。大好き。
      だいたい東京事変か椎名林檎を聴いてる。
      その他だと、宇多田ヒカル、King Gnu、米津玄師、H ZETTRIOなど。
      以下はおすすめの曲。東京事変と椎名林檎は正直全部だけど、特におすすめのやつだけ。
    </p>
    <h4>おすすめの曲</h4>
    <br>
    <h5>東京事変</h5>
    <ul>
      <li>能動的三分間</li>
      <li>閃光少女</li>
      <li>永遠の不在証明</li>
      <li>りんごのうた</li>
      <li>群青日和</li>
      <li>キラーチューン</li>
      <li>心</li>
      <li>青のID</li>
      <li>透明人間</li>
      <li>21世紀宇宙の子</li>
      <li>空が鳴っている</li>
    </ul>
    <h5>椎名林檎</h5>
    <ul>
      <li>幸福論</li>
      <li>正しい街</li>
      <li>歌舞伎町の女王</li>
      <li>丸の内サディスティック</li>
      <li>NIPPON</li>
      <li>人生は夢だらけ</li>
      <li>ジユーダム</li>
      <li>ギブス</li>
      <li>長く短い祭（椎名林檎&浮雲）</li>
      <li>獣ゆく細道（椎名林檎&宮本浩次）</li>
      <li>目抜き通り（椎名林檎&トータス松本）</li>
      <li>二時間だけのバカンス（椎名林檎&宇多田ヒカル</li>
    </ul>
    <h5>宇多田ヒカル</h5>
    <ul>
      <li>Beautiful World</li>
      <li>桜流し</li>
      <li>あなた</li>
      <li>Can You Keep A Secret?</li>
      <li>Face My Fears</li>
      <li>花束を君に</li>
      <li>First Love</li>
      <li>Auomatic</li>
    </ul>
    <h5>King Gnu</h5>
    <ul>
      <li>三文小説</li>
      <li>飛行艇</li>
      <li>どろん</li>
      <li>Teenager Forever</li>
      <li>Prayer X</li>
      <li>Slumberland</li>
      <li>The hole</li>
    </ul>
    <h5>米津玄師</h5>
    <ul>
      <li>vivi</li>
      <li>ピースサイン</li>
      <li>海の幽霊</li>
      <li>LOSER</li>
      <li>砂の惑星（ハチ）</li>
      <li>Nighthawks</li>
      <li>Flamingo</li>
      <li>orion</li>
      <li>カムパネルラ</li>
      <li>アイネクライネ</li>
    </ul>
    <h5>H ZETTRIO</h5>
    <ul>
      <li>Dancing in the mood</li>
      <li>Beautiful Flight</li>
      <li>Neo Japaneseque</li>
      <li>あしたのワルツ</li>
    </ul>
    <div class="border" />
    <br>
    <h3>写真撮影</h3>
    <p>
      実は中1から写真部に所属していて、プログラミング歴よりも写真歴の方が長いんですよね。
      でもいつの間にか写真よりもプログラミングの方が全然上達していて。写真の才能はなかったのかな。
      今でも下手の横好きで続けてはいますが、撮る頻度も激減してしまって。
      なんなら中二の時の方が上手かったかもしれない。
      中二の時に一回だけ<a href="https://www.tokyo-park.or.jp/special/photo_2017/index.html" target="blank_">東京都公園協会 公園フォトコンテスト</a>というコンクールで入選を頂いたことがあるんですよね。
      現時点での最高傑作を出せと言われたらこの写真かもしれないw
      昔より体力が無くなったのも撮影頻度が減った原因の一つかもしれないですね。
      最近は24-105すら持ち歩くのが億劫になって、50mm単焦点だけで撮影に行くこともしばしばw
    </p>
    <h4>撮影機材</h4>
    <br>
    <ul>
      <li>Canon EOS 6D MarkII</li>
      <li>Canon EF24-105mm F3.5-5.6 IS STM</li>
      <li>Canon EF50mm F1.8 STM</li>
      <li>SIGMA 100-400mm F5-6.3 DG OS HSM</li>
    </ul>
    <br>
    <div class="border" />
    <br>
    <h3>文化祭</h3>
    <p>
      中2から文化祭執行部をやり続けて、もはや文化祭が趣味になった。
      高3になってまでやってるのはもう末期。
    </p>
  </div>
</template>

<style scoped>
p{
  white-space: pre-wrap;
}
</style>
