<template>
  <div class="container">
    <div class="py-4" />
    <h1>閑話</h1>
    <br>
    <p>趣味など、どうでも良い話をつらつらと書き連ねていこうと思います。</p>
    <br>
    <h3>
      趣味
    </h3>
    <br>
    <ul>
      <li>写真撮影</li>
      <li>読書</li>
      <li>アニメ</li>
      <li>音楽鑑賞</li>
      <li>文化祭</li>
    </ul>
    <br>
    <div class="border" />
    <br>
    <h3>写真撮影</h3>
    <p>
      実は中1から写真部に所属していて、プログラミング歴よりも写真歴の方が長いんですよね。
      でもいつの間にか写真よりもプログラミングの方が全然上達していて。写真の才能はなかったのかな。
      今でも下手の横好きで続けてはいますが、撮る頻度も激減してしまって。
      なんなら中二の時の方が上手かったかもしれない。
      中二の時に一回だけ<a href="https://www.tokyo-park.or.jp/special/photo_2017/index.html" target="blank_">東京都公園協会 公園フォトコンテスト</a>というコンクールで入選を頂いたことがあるんですよね。
      現時点での最高傑作を出せと言われたらこの写真かもしれないw
      昔より体力が無くなったのも撮影頻度が減った原因の一つかもしれないですね。
      最近は24-105すら持ち歩くのが億劫になって、50mm単焦点だけで撮影に行くこともしばしばw
    </p>
    <h4>撮影機材</h4>
    <br>
    <ul>
      <li>Canon EOS 6D MarkII</li>
      <li>Canon EF24-105mm F3.5-5.6 IS STM</li>
      <li>Canon EF50mm F1.8 STM</li>
      <li>SIGMA 100-400mm F5-6.3 DG OS HSM</li>
    </ul>
    <br>
    <div class="border" />
    <br>
    <h3>読書</h3>
    <p>
      僕、実は結構本を読む人なんですよ。
      幼稚園児の頃から児童文学を読み耽っていて、エルマーのぼうけんとかめちゃ読んでましたね。あのシリーズだったら16ひきのりゅうが一番好き。
      小2くらいから星新一にどハマりして、小4くらいまでずーっと星新一読んでました。新潮文庫出版のやつは全巻読んでるはず。
      でもどこで道を踏み外したのか、小5くらいからラノベばっか読むようになり、休み時間机の上に俺ガイルを積んでるような小学生になってしまいました。
      とはいえ一般文芸（いわゆるエンタメ小説や純文学など）もある程度は読んでいたようで、小5の時に書いたおすすめの本が「神様のカルテ」になっていました。あれも良い話ですよね。大好き。
      小6の頃は有川浩にどハマりしていた記憶が。図書館戦争でハマり、植物図鑑や阪急電車、レインツリーの国などいろいろ読んでました。
      そんなこんなで中学生になった頃には典型的なオタクになっており、学校の机の上にラノベを10冊以上積み上げてラノベタワー作ったりとかしてました。男子校最高。
      中1になってからは海外文学にも手を出すようになり、カミュの異邦人やカフカの変身などを読んでいました。
      ラノベ以外の小説であれば母親がいくらでも買ってくれたので、それが功を奏したのかもしれません。
    </p>
  </div>
</template>

<style scoped>
p{
  white-space: pre-wrap;
}
</style>
